tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "bundletool"
brew "dex2jar"
brew "ruby"
brew "fastlane"
brew "firebase-cli"
brew "folly"
brew "git-crypt"
brew "guile"
brew "p11-kit"
brew "gnutls"
brew "gnupg"
brew "imagemagick"
brew "jq"
brew "watchman"
brew "yadm"
brew "yarn"
brew "jenv"
brew "nvm"
brew "apktool"
cask "android-commandlinetools"
cask "google-chrome"
cask "visual-studio-code"
cask "intellij-idea"
cask "koekeishiya/formulae/yabai"