tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# application
cask "visual-studio-code"
cask "figma"
cask "arc"
cask "slack"
cask "spotify"
cask "whatsapp"
cask "orbstack"

# utility
brew "gnutls"
brew "gnupg"
brew "jq"
brew "jenv"
brew "nvm"
brew "fastlane"
brew "watchman"
brew "ruby"
brew "scrcpy"
brew "python@3.11"

# java
cask "zulu@17"

# mobile debugger
cask "flipper"

# android
cask "android-platform-tools"
cask "android-commandlinetools"
brew "bundletool"
brew "apktool"


# ios
brew "ios-deploy"
brew "cocoapods"
# install android sdk
# sdkmanager "platform-tools" "emulator" "platforms;android-34"
# avdmanager create avd -n Pixel_6_Pro_API_34_PlayStore_ARM -k "system-images;android-34;google_apis_playstore;arm64-v8a" --device "pixel_6_pro"
# sdkmanager "system-images;android-34;google_apis_playstore;arm64-v8a"
# sdkmanager --licenses

# AI Tools
brew "ollama"