#tap "homebrew/bundle"
#tap "homebrew/cask"
#tap "homebrew/core"
#tap "homebrew/cask-fonts"
#tap "homebrew/services"

# application
cask "visual-studio-code"
cask "figma"
#cask "arc"
cask "slack"
cask "spotify"
cask "whatsapp"
cask "orbstack"
cask "chatbox"

# utility
brew "gnutls"
brew "gnupg"
brew "jq"
brew "jenv"
brew "nvm"
brew "ruby"
brew "fastlane"
brew "watchman"
brew "scrcpy"
brew "python@3.11"
# brew "zsh"

# golang
brew "go"

# java
cask "zulu@17"

# android
cask "android-platform-tools"
cask "android-commandlinetools"
brew "bundletool"
brew "apktool"

# ios
brew "ios-deploy"
brew "cocoapods"
# install android sdk
# sdkmanager "platform-tools" "emulator" "platforms;android-34"
# sdkmanager "system-images;android-34;google_apis_playstore;arm64-v8a"
# check device in avd
# avdmanager list devices
# avdmanager create avd -n "Pixel 7 Pro" -k "system-images;android-34;google_apis_playstore;arm64-v8a" --device "pixel_6_pro"
# sdkmanager --licenses
#install tablet (nexus 9/10)
#avdmanager create avd -n tablet -d 82 -k "system-images;android-34;google_apis_playstore;arm64-v8a"
#install phone (nexus)
#avdmanager create avd -n tablet -d 1 -k "system-images;android-34;google_apis_playstore;arm64-v8a"

# API Testing
brew "bruno"